// Функція, яка перевіряє, чи є число паліндромом
fn is_palindrome(x: u32) -> bool {
    // Конвертуємо число в рядок
    let s = x.to_string();
    // Перевіряємо, чи є рядок рівним своєму реверсованому вигляду
    s == s.chars().rev().collect::<String>()
}

fn main() {
    assert_eq!(true, is_palindrome(1237321)); // 1237321 є паліндромом
    assert_eq!(false, is_palindrome(1237322)); // 1237322 не є паліндромом
}



/*
is_palindrome
Приймає число x типу u32 та повертає true, якщо число є паліндромом, або false в іншому випадку.
Конвертує число в рядок за допомогою to_string().
Використовує метод chars() для отримання ітератора символів, реверсує його за допомогою rev(), а потім збирає реверсований рядок за допомогою collect().
Порівнює оригінальний рядок з реверсованим. Якщо вони рівні, число є паліндромом.
*/